import random
#Λίστα ερωτήσεων
questions = [
    ("Ποια είναι η πρωτεύουσα της Γαλλίας;","παρίσι"),
    ("Ποιο είναι το μεγαλύτερο ζώο στον κόσμο;", "μπλε φάλαινα"),
    ("Ποια είναι η πιο ψηλή κορυφή στον κόσμο;", "έβερεστ"),
    ("Ποιος έγραψε την 'Ιλιάδα';", "όμηρος"),
    ("Ποιος ανακάλυψε την Αμερική;", "κολόμβος"),
    ("Πως ονομαζόταν ο Σκύλος του Οδυσσέα;", "άργος"),
    ("Ποια είναι η μεγαλύτερη ήπειρος στον κόσμο;", "ασία"),
    ("Ποιο είναι το εθνικό νόμισμα της Ιαπωνίας;", "γιεν"),
    ("Πόσα μάτια έχει η Μέλισσα;", "5"),
    ("Ποιος ήταν ο πρώτος άνθρωπος που πάτησε στη Σελήνη;", "άρμστρονγκ")
]

# Επιλέγουμε 5 τυχαίες ερωτήσεις
selected_questions = random.sample(questions, 5)
score = 0

for question, answer in selected_questions:
    user_answer = input(f"{question} ").strip().lower()  # Μετατροπή σε πεζά για να μην είναι case sensitive
    if user_answer == answer:
        print("ΣΩΣΤΟ")
        score += 1 #Αν η απάντηση είναι σωστή προσθέτουμε +1 στο score
    else:
        print("ΛΑΘΟΣ")

# Αποτελέσματα απαντήσεων 
print(f"\nΣκορ: {score}/5")
percentage = (score / 5) * 100
print(f"Το Ποσοστό των Σωστών Απαντήσεων είναι: {percentage}%")