while True:
    try:
        #Ζητάμε από τον χρήστη να δώσει τιμή και ελέγχουμε αν ο αριθμός είναι θετικός
        income = float(input("Δώστε ετήσιο εισόδημα: \n"))
        if income < 0:
            print("Παρακαλώ δώστε θετικό αριθμό\n")
            continue

        #Υπολογίζουμε τον φόρο βάσει της κλίμακας
        tax = 0
        if income <= 10000:
            tax = 0
        elif income <= 20000:
            tax = (income - 10000) * 0.10
        elif income <= 40000:
            tax = (10000 * 0.10) + (income - 20000) * 0.20 #Προσθέτουμε τον προηγούμενο φόρο
        else:
            tax = (10000 * 0.10) + (20000 * 0.20) + (income - 40000) * 0.30 #Προσθέτουμε τους 2 προηγόυμενους φόρους

        #Υπολογισμός καθαρού εισοδήματος
        clincome = income - tax

        print(f"Συνολικός φόρος: {tax:.2f}$")
        print(f"Καθαρό εισόδημα: {clincome:.2f}$")
        break

    except ValueError:
        print("Σφάλμα! Δώστε αριθμό")